import pytest
from toolkit.calculator import calculate


@pytest.mark.parametrize("expression, expected_result", [
    # Порядок операций
    ("1+2*3/1", eval("1+2*3/1")),
    ("5*7-3/2+58/4-21+3*10", eval("5*7-3/2+58/4-21+3*10")),
    # Поддержка унарного минуса
    ("1*-3+7", eval("1*-3+7")),
    ("-31*391+301-1949/-2", eval("-31*391+301-1949/-2")),
    # Игнорирование пробелов
    ("1 + 2 * 3 / 1", eval("1 + 2 * 3 / 1")),
    # Арифметика с дробями
    ("1 / 2 / 3", eval("1 / 2 / 3")),
    ("84 / 103 + 91 / 138 - 313/122223", eval("84 / 103 + 91 / 138 - 313/122223")),
    # Поддержка унарного плюса и арифметики целых и вещественных чисел
    ("+3 * 5 - 10 / 3", eval("+3 * 5 - 10 / 3")),
    ("1/10 + 2/10", eval("1/10 + 2/10")),
    # Поддержка чисел с плавающей запятой / точкой. Стоит заметить, что
    # Python не поддерживает плавающую запятую
    ("0.3134+0,13130003-1*0.5", eval("0.3134+0.13130003-1*0.5")),
    ("3.1415926+2.718281828", eval("3.1415926+2.718281828")),
    # Порядок операций со скобками
    ("(13-31)*(31/3)-(9335-1929)/39--1", eval("(13-31)*(31/3)-(9335-1929)/39--1")),
    ("(1+3)*(4*5)-(10/5+3)", eval("(1+3)*(4*5)-(10/5+3)")),
    # Пробелы в различных местах и несколько пробелов
    (" ( 7 * 10)  + 12    -3 *(3 + 10 ) ", eval(" ( 7 * 10)  + 12    -3 *(3 + 10 ) "))
])
def test_calculator_positive(expression: str, expected_result: float):
    assert float(calculate(expression)) == float(expected_result)
